In [1]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import matplotlib.pyplot as plt # for data visualization
import seaborn as sns # for statistical data visualization
import pylab 
import scipy.stats as stats
import datetime
%matplotlib inline

pd.set_option('display.max_columns', None)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

In [2]:
titanic = pd.read_csv('Dane/train.csv')

In [5]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [4]:
# One-Hot Encoding OHE
# dane kategoryczne na liczbowe
pd.get_dummies(titanic['Sex']).head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [8]:
pd.get_dummies(titanic['Sex'], drop_first = True).head()

   male
0     1
1     0
2     0
3     0
4     1

In [6]:
pd.get_dummies(titanic['Embarked']).head()

   C  Q  S
0  0  0  1
1  1  0  0
2  0  0  1
3  0  0  1
4  0  0  1

In [11]:
# podzial na 3 kategorie
s = pd.Series(data = [x**2 for x in range(11)],
            index = list('abcdefghijk'))
s

a      0
b      1
c      4
d      9
e     16
f     25
g     36
h     49
i     64
j     81
k    100
dtype: int64

In [12]:
pd.cut(s,3) # dzieli wedlu range wartosci s na 3 dane

a      (-0.1, 33.333]
b      (-0.1, 33.333]
c      (-0.1, 33.333]
d      (-0.1, 33.333]
e      (-0.1, 33.333]
f      (-0.1, 33.333]
g    (33.333, 66.667]
h    (33.333, 66.667]
i    (33.333, 66.667]
j     (66.667, 100.0]
k     (66.667, 100.0]
dtype: category
Categories (3, interval[float64, right]): [(-0.1, 33.333] < (33.333, 66.667] < (66.667, 100.0]]

In [13]:
pd.qcut(s,3) # dzieli ze wzgledu na umiejscowienie na liście

a    (-0.001, 11.333]
b    (-0.001, 11.333]
c    (-0.001, 11.333]
d    (-0.001, 11.333]
e    (11.333, 44.667]
f    (11.333, 44.667]
g    (11.333, 44.667]
h     (44.667, 100.0]
i     (44.667, 100.0]
j     (44.667, 100.0]
k     (44.667, 100.0]
dtype: category
Categories (3, interval[float64, right]): [(-0.001, 11.333] < (11.333, 44.667] < (44.667, 100.0]]

## Serializacja

In [14]:
# zapisywanie lelmentów pythonowych na dysk
import pickle

In [15]:
test_dict = {"Hello": "World!"}
with open("test.pickle", "wb") as outfile:
 	# "wb" argument opens the file in binary mode
	pickle.dump(test_dict, outfile)

In [16]:
import numpy as np
import tensorflow as tf
from tensorflow.keras.datasets import mnist
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Conv2D, Dense, AveragePooling2D, Dropout, Flatten
from tensorflow.keras.utils import to_categorical
from tensorflow.keras.callbacks import EarlyStopping
 
# Load MNIST digits
(X_train, y_train), (X_test, y_test) = mnist.load_data()
 
# Reshape data to (n_samples, height, wiedth, n_channel)
X_train = np.expand_dims(X_train, axis=3).astype("float32")
X_test = np.expand_dims(X_test, axis=3).astype("float32")
 
# One-hot encode the output
y_train = to_categorical(y_train)
y_test = to_categorical(y_test)
 
# LeNet5 model
model = Sequential([
    Conv2D(6, (5,5), input_shape=(28,28,1), padding="same", activation="tanh"),
    AveragePooling2D((2,2), strides=2),
    Conv2D(16, (5,5), activation="tanh"),
    AveragePooling2D((2,2), strides=2),
    Conv2D(120, (5,5), activation="tanh"),
    Flatten(),
    Dense(84, activation="tanh"),
    Dense(10, activation="softmax")
])
 
# Train the model
model.compile(loss="categorical_crossentropy", optimizer="adam", metrics=["accuracy"])
earlystopping = EarlyStopping(monitor="val_loss", patience=4, restore_best_weights=True)
model.fit(X_train, y_train, validation_data=(X_test, y_test), epochs=100, batch_size=32, callbacks=[earlystopping])
 
# Evaluate the model
print(model.evaluate(X_test, y_test, verbose=0))
 
# Pickle to serialize and deserialize
pickled_model = pickle.dumps(model)
reconstructed = pickle.loads(pickled_model)
 
# Evaluate again
print(reconstructed.evaluate(X_test, y_test, verbose=0))

Epoch 1/100
1875/1875 [==============================] - 32s 16ms/step - loss: 0.1491 - accuracy: 0.9553 - val_loss: 0.0583 - val_accuracy: 0.9809
Epoch 2/100
1875/1875 [==============================] - 28s 15ms/step - loss: 0.0635 - accuracy: 0.9809 - val_loss: 0.0809 - val_accuracy: 0.9728
Epoch 3/100
1875/1875 [==============================] - 29s 16ms/step - loss: 0.0467 - accuracy: 0.9850 - val_loss: 0.0480 - val_accuracy: 0.9841
Epoch 4/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0392 - accuracy: 0.9877 - val_loss: 0.0528 - val_accuracy: 0.9836
Epoch 5/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0334 - accuracy: 0.9894 - val_loss: 0.0573 - val_accuracy: 0.9837
Epoch 6/100
1875/1875 [==============================] - 27s 14ms/step - loss: 0.0281 - accuracy: 0.9910 - val_loss: 0.0396 - val_accuracy: 0.9883
Epoch 7/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0244 - accuracy: 0.9921 - val_loss: 0.0406 - val_accuracy: 0.9876
Epoch 8/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0224 - accuracy: 0.9927 - val_loss: 0.0490 - val_accuracy: 0.9868
Epoch 9/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0204 - accuracy: 0.9934 - val_loss: 0.0393 - val_accuracy: 0.9874
Epoch 10/100
1875/1875 [==============================] - 28s 15ms/step - loss: 0.0176 - accuracy: 0.9942 - val_loss: 0.0439 - val_accuracy: 0.9873
Epoch 11/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0155 - accuracy: 0.9946 - val_loss: 0.0495 - val_accuracy: 0.9857
Epoch 12/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0146 - accuracy: 0.9953 - val_loss: 0.0475 - val_accuracy: 0.9858
Epoch 13/100
1875/1875 [==============================] - 26s 14ms/step - loss: 0.0139 - accuracy: 0.9955 - val_loss: 0.0480 - val_accuracy: 0.9864
[0.03927366062998772, 0.9873999953269958]
[0.03927366062998772, 0.9873999953269958]

## Profiling

In [23]:
# tworzy fajny raport html do przeglądania pliku, wykresy, podsumowania itp
from pandas_profiling import ProfileReport
# Generate the Profiling Report
import pandas as pd

C:\Users\AsusF512ua-ej269t\AppData\Local\Temp\ipykernel_22816\3470164469.py:1: DeprecationWarning: `import pandas_profiling` is going to be deprecated by April 1st. Please use `import ydata_profiling` instead.
  from pandas_profiling import ProfileReport

In [27]:
titianic_df = pd.read_csv('Dane/titanic.csv', sep=',', encoding='utf-8')

In [28]:
profile = ProfileReport(titianic_df,
                         title="Titanic Dataset",
                         html={'style': {'full_width': True}},
                         sort=None)
                        # Save to file
profile.to_file('report.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]